yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l052r8.h
/* LCD Port mask register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SEG08       : 1;
  unsigned char SEG09       : 1;
  unsigned char SEG10       : 1;
  unsigned char SEG11       : 1;
  unsigned char SEG12       : 1;
  unsigned char SEG13       : 1;
  unsigned char SEG14       : 1;
  unsigned char SEG15       : 1;
} __BITS_LCD_PM1;
#endif
__IO_REG8_BIT(LCD_PM1,     0x5405, __READ_WRITE, __BITS_LCD_PM1);

/* LCD Port mask register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SEG16       : 1;
  unsigned char SEG17       : 1;
  unsigned char SEG18       : 1;
  unsigned char SEG19       : 1;
  unsigned char SEG20       : 1;
  unsigned char SEG21       : 1;
  unsigned char SEG22       : 1;
  unsigned char SEG23       : 1;
} __BITS_LCD_PM2;
#endif
__IO_REG8_BIT(LCD_PM2,     0x5406, __READ_WRITE, __BITS_LCD_PM2);

/* LCD Port mask register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SEG24       : 1;
  unsigned char SEG25       : 1;
  unsigned char SEG26       : 1;
  unsigned char SEG27       : 1;
  unsigned char SEG28       : 1;
  unsigned char SEG29       : 1;
  unsigned char SEG30       : 1;
  unsigned char SEG31       : 1;
} __BITS_LCD_PM3;
#endif
__IO_REG8_BIT(LCD_PM3,     0x5407, __READ_WRITE, __BITS_LCD_PM3);

/* LCD Port mask register 4 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SEG32       : 1;
  unsigned char SEG33       : 1;
  unsigned char SEG34       : 1;
  unsigned char SEG35       : 1;
  unsigned char SEG36       : 1;
  unsigned char SEG37       : 1;
  unsigned char SEG38       : 1;
  unsigned char SEG39       : 1;
} __BITS_LCD_PM4;
#endif
__IO_REG8_BIT(LCD_PM4,     0x5408, __READ_WRITE, __BITS_LCD_PM4);

/* LCD Port mask register 5 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SEG40       : 1;
  unsigned char SEG41       : 1;
  unsigned char SEG42       : 1;
  unsigned char SEG43       : 1;
} __BITS_LCD_PM5;
#endif
__IO_REG8_BIT(LCD_PM5,     0x5409, __READ_WRITE, __BITS_LCD_PM5);

/* LCD display memory 0 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S000        : 1;
  unsigned char S001        : 1;
  unsigned char S002        : 1;
  unsigned char S003        : 1;
  unsigned char S004        : 1;
  unsigned char S005        : 1;
  unsigned char S006        : 1;
  unsigned char S007        : 1;
} __BITS_LCD_RAM0;
#endif
__IO_REG8_BIT(LCD_RAM0,    0x540C, __READ_WRITE, __BITS_LCD_RAM0);

/* LCD display memory 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S008        : 1;
  unsigned char S009        : 1;
  unsigned char S010        : 1;
  unsigned char S011        : 1;
  unsigned char S012        : 1;
  unsigned char S013        : 1;
  unsigned char S014        : 1;
  unsigned char S015        : 1;
} __BITS_LCD_RAM1;
#endif
__IO_REG8_BIT(LCD_RAM1,    0x540D, __READ_WRITE, __BITS_LCD_RAM1);

/* LCD display memory 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S016        : 1;
  unsigned char S017        : 1;
  unsigned char S018        : 1;
  unsigned char S019        : 1;
  unsigned char S020        : 1;
  unsigned char S021        : 1;
  unsigned char S022        : 1;
  unsigned char S023        : 1;
} __BITS_LCD_RAM2;
#endif
__IO_REG8_BIT(LCD_RAM2,    0x540E, __READ_WRITE, __BITS_LCD_RAM2);

/* LCD display memory 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S024        : 1;
  unsigned char S025        : 1;
  unsigned char S026        : 1;
  unsigned char S027        : 1;
  unsigned char S100        : 1;
  unsigned char S101        : 1;
  unsigned char S102        : 1;
  unsigned char S103        : 1;
} __BITS_LCD_RAM3;
#endif
__IO_REG8_BIT(LCD_RAM3,    0x540F, __READ_WRITE, __BITS_LCD_RAM3);

/* LCD display memory 4 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S104        : 1;
  unsigned char S105        : 1;
  unsigned char S106        : 1;
  unsigned char S107        : 1;
  unsigned char S108        : 1;
  unsigned char S109        : 1;
  unsigned char S110        : 1;
  unsigned char S111        : 1;
} __BITS_LCD_RAM4;
#endif
__IO_REG8_BIT(LCD_RAM4,    0x5410, __READ_WRITE, __BITS_LCD_RAM4);

/* LCD display memory 5 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S112        : 1;
  unsigned char S113        : 1;
  unsigned char S114        : 1;
  unsigned char S115        : 1;
  unsigned char S116        : 1;
  unsigned char S117        : 1;
  unsigned char S118        : 1;
  unsigned char S119        : 1;
} __BITS_LCD_RAM5;
#endif
__IO_REG8_BIT(LCD_RAM5,    0x5411, __READ_WRITE, __BITS_LCD_RAM5);

/* LCD display memory 6 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S120        : 1;
  unsigned char S121        : 1;
  unsigned char S122        : 1;
  unsigned char S123        : 1;
  unsigned char S124        : 1;
  unsigned char S125        : 1;
  unsigned char S126        : 1;
  unsigned char S127        : 1;
} __BITS_LCD_RAM6;
#endif
__IO_REG8_BIT(LCD_RAM6,    0x5412, __READ_WRITE, __BITS_LCD_RAM6);

/* LCD display memory 7 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S200        : 1;
  unsigned char S201        : 1;
  unsigned char S202        : 1;
  unsigned char S203        : 1;
  unsigned char S204        : 1;
  unsigned char S205        : 1;
  unsigned char S206        : 1;
  unsigned char S207        : 1;
} __BITS_LCD_RAM7;
#endif
__IO_REG8_BIT(LCD_RAM7,    0x5413, __READ_WRITE, __BITS_LCD_RAM7);

/* LCD display memory 8 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S208        : 1;
  unsigned char S209        : 1;
  unsigned char S210        : 1;
  unsigned char S211        : 1;
  unsigned char S212        : 1;
  unsigned char S213        : 1;
  unsigned char S214        : 1;
  unsigned char S215        : 1;
} __BITS_LCD_RAM8;
#endif
__IO_REG8_BIT(LCD_RAM8,    0x5414, __READ_WRITE, __BITS_LCD_RAM8);

/* LCD display memory 9 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S216        : 1;
  unsigned char S217        : 1;
  unsigned char S218        : 1;
  unsigned char S219        : 1;
  unsigned char S220        : 1;
  unsigned char S221        : 1;
  unsigned char S222        : 1;
  unsigned char S223        : 1;
} __BITS_LCD_RAM9;
#endif
__IO_REG8_BIT(LCD_RAM9,    0x5415, __READ_WRITE, __BITS_LCD_RAM9);

/* LCD display memory 10 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S224        : 1;
  unsigned char S225        : 1;
  unsigned char S226        : 1;
  unsigned char S227        : 1;
  unsigned char S300        : 1;
  unsigned char S301        : 1;
  unsigned char S302        : 1;
  unsigned char S303        : 1;
} __BITS_LCD_RAM10;
#endif
__IO_REG8_BIT(LCD_RAM10,   0x5416, __READ_WRITE, __BITS_LCD_RAM10);

